#include "한글"

상수 정수 출력창가로 대입 사 곱하기 십 쌍반점
상수 정수 출력창세로 대입 이 곱하기 십 쌍반점

자료정의 구조체 플레이어
중괄호열기
	정수 ㅌ 쌍반점	// x
	정수 ㅍ 쌍반점	// y
중괄호닫기 플레이어 쌍반점

플레이어 게임플레이어 쌍반점

빈 초기화 괄호열고닫기 쌍반점
빈 업데이트 괄호열고닫기 쌍반점
빈 게임플레이어지우기 괄호열고닫기 쌍반점
빈 게임플레이어그리기 괄호열고닫기 쌍반점
빈 ㅌㅍ가기 괄호열기 정수 ㅌ 과 정수 ㅍ 괄호닫기 쌍반점

정수 진입점 괄호열고닫기
중괄호열기
	초기화 괄호열고닫기 쌍반점

	동안 괄호열기 참 괄호닫기
	중괄호열기
		업데이트 괄호열고닫기 쌍반점
	중괄호닫기
	
	반환 영 쌍반점
중괄호닫기

빈 초기화 괄호열고닫기
중괄호열기
	시스템 괄호열기 "title 한글 문법으로 만든 예제" 괄호닫기 쌍반점
	시스템 괄호열기 "mode con cols=40 lines=20" 괄호닫기 쌍반점

	출력창_이동막대_정보 출력창이동막대정보 쌍반점

	출력창이동막대정보 멤버 bVisible 대입 거짓 쌍반점
	출력창이동막대정보 멤버 dwSize 대입 일 쌍반점

	출력창이동막대정보설정 괄호열기 표준관리자얻기 괄호열기 표준_출력_관리자 괄호닫기 와 주소 출력창이동막대정보 괄호닫기 쌍반점

	게임플레이어 멤버 ㅌ 대입 출력창가로 비트오른쪽시프트 일 쌍반점
	게임플레이어 멤버 ㅍ 대입 출력창세로 비트오른쪽시프트 일 쌍반점

	게임플레이어그리기 괄호열고닫기 쌍반점
중괄호닫기

빈 업데이트 괄호열고닫기
중괄호열기
	정수 키 대입 누름자판눌림 물음표 눌린자판얻기 쌍점 마이너스 이 쌍반점

	선택 괄호열기 키 괄호닫기
	중괄호열기
	// W키 입력
	선택자 팔 곱하기 십 더하기 칠 쌍점
	선택자 백 더하기 십 더하기 구 쌍점
		만약 괄호열기 게임플레이어 멤버 ㅍ 빼기 일 보다작거나같음 영 괄호닫기
		중괄호열기
			게임플레이어지우기 괄호열고닫기 쌍반점
			
			게임플레이어 멤버 ㅍ 빼기대입 일 쌍반점
			
			게임플레이어그리기 괄호열고닫기 쌍반점
		중괄호닫기
		
		중단 쌍반점

	// A키 입력
	선택자 육 곱하기 십 더하기 오 쌍점
	선택자 구 곱하기 십 더하기 칠 쌍점
		만약 괄호열기 게임플레이어 멤버 ㅌ 빼기 일 보다작거나같음 영 괄호닫기
		중괄호열기
			게임플레이어지우기 괄호열고닫기 쌍반점
			
			게임플레이어 멤버 ㅌ 빼기대입 일 쌍반점
			
			게임플레이어그리기 괄호열고닫기 쌍반점
		중괄호닫기
		
		중단 쌍반점

	// S키 입력
	선택자 팔 곱하기 십 더하기 삼 쌍점
	선택자 백 더하기 십 더하기 오 쌍점
		만약 괄호열기 게임플레이어 멤버 ㅍ 더하기 일 보다큰 출력창세로 괄호닫기
		중괄호열기
			게임플레이어지우기 괄호열고닫기 쌍반점
			
			게임플레이어 멤버 ㅍ 더하기대입 일 쌍반점
			
			게임플레이어그리기 괄호열고닫기 쌍반점
		중괄호닫기
		
		중단 쌍반점

	// D키 입력
	선택자 육 곱하기 십 더하기 팔 쌍점
	선택자 백 쌍점
		만약 괄호열기 게임플레이어 멤버 ㅌ 더하기 일 보다큰 출력창가로 빼기 일 괄호닫기
		중괄호열기
			게임플레이어지우기 괄호열고닫기 쌍반점
			
			게임플레이어 멤버 ㅌ 더하기대입 일 쌍반점
			
			게임플레이어그리기 괄호열고닫기 쌍반점
		중괄호닫기
		
		중단 쌍반점
	중괄호닫기
중괄호닫기

빈 게임플레이어지우기 괄호열고닫기
중괄호열기
	ㅌㅍ가기 괄호열기 게임플레이어 멤버 ㅌ 과 게임플레이어 멤버 ㅍ 괄호닫기 쌍반점
	출력 "  " 쌍반점
중괄호닫기

빈 게임플레이어그리기 괄호열고닫기
중괄호열기
	ㅌㅍ가기 괄호열기 게임플레이어 멤버 ㅌ 과 게임플레이어 멤버 ㅍ 괄호닫기 쌍반점
	출력 "옷" 쌍반점
중괄호닫기

빈 ㅌㅍ가기 괄호열기 정수 ㅌ 과 정수 ㅍ 괄호닫기
중괄호열기
	좌표 위치 대입 중괄호열기 ㅌ 과 ㅍ 중괄호닫기 쌍반점

	출력창이동막대좌표설정 괄호열기 표준관리자얻기 괄호열기 표준_출력_관리자 괄호닫기 와 위치 괄호닫기 쌍반점
중괄호닫기