#include "한글"

/*

빈 파이출력 괄호열기닫기
중괄호열기
	출력 "3.1415926535897" 세미콜론
중괄호닫기

정수32 두수더하기 괄호열기 정수32 ㄱ 과 정수32 ㄴ 괄호닫기
중괄호열기
	반환 ㄱ 더하기 ㄴ 세미콜론
중괄호닫기

정수32 진입점 괄호열기 정수32 매개변수개수 와 문자 포인터 포인터 매개변수목록 괄호닫기
중괄호열기
	정수32 배열 대괄호열기닫기 대입
	중괄호열기
		삼 과 일 과 사 와 일 과 오 와 구 와 이 와 육 과 오 와 삼 과 오 와 팔 과 구 와 칠
	중괄호닫기 세미콜론

	정수32 인덱스 세미콜론
	정수32 정수1 대입 오 세미콜론
	정수32 정수2 대입 삼 세미콜론
	정수32 정수3 세미콜론
	정수32 포인터 정수포인터 대입 주소 정수1 세미콜론
	상수 실수 파이 대입 삼 더하기 소수1 더하기 소수2 곱하기 사 더하기 소수3 더하기 소수4 곱하기 오 더하기 소수5 곱하기 구 더하기 소수6 곱하기 이 세미콜론
	실수 반지름 대입 소수1 곱하기 오 세미콜론
	
	출력 "안녕 세상!" 비트왼쪽시프트 줄바꿈 세미콜론

	정수3 대입 두수더하기 괄호열기 정수1 과 정수2 괄호닫기 세미콜론

	출력 정수1 비트왼쪽시프트 " + " 비트왼쪽시프트 정수2 비트왼쪽시프트 " = " 비트왼쪽시프트 정수3 비트왼쪽시프트 줄바꿈 세미콜론

	출력 반지름 비트왼쪽시프트 " * " 비트왼쪽시프트 반지름 비트왼쪽시프트 " * " 비트왼쪽시프트 파이 비트왼쪽시프트 " = " 비트왼쪽시프트 반지름 곱하기 반지름 곱하기 파이 비트왼쪽시프트 "\n" 세미콜론

	반복 괄호열기 인덱스 대입 영 세미콜론 인덱스 보다큰 오 세미콜론 인덱스 증감 괄호닫기
	중괄호열기
		출력 인덱스 세미콜론
	중괄호닫기

	출력 줄바꿈 세미콜론

	입력 반지름 세미콜론
	출력 반지름 비트왼쪽시프트 " * " 비트왼쪽시프트 반지름 비트왼쪽시프트 " * " 비트왼쪽시프트 파이 비트왼쪽시프트 " = " 비트왼쪽시프트 반지름 곱하기 반지름 곱하기 파이 비트왼쪽시프트 "\n" 세미콜론

	만약 괄호열기 반지름 다름 영 괄호닫기
	중괄호열기
		파이출력 괄호열기닫기 세미콜론
	중괄호닫기

	출력 줄바꿈 비트왼쪽시프트 포인터 정수포인터 비트왼쪽시프트 줄바꿈 세미콜론

	인덱스 대입 영 세미콜론

	동안 괄호열기 인덱스 보다크거나같음 십 더하기 삼 괄호닫기
	중괄호열기
		출력 배열 대괄호열기 인덱스 대괄호닫기 세미콜론
		인덱스 증감 세미콜론
	중괄호닫기

	반환 영 세미콜론
중괄호닫기

*/