#include "한글"

상수 정수 출력창_가로 대입 오 곱하기 십 더하기 이 쌍반점
상수 정수 출력창_세로 대입 이 곱하기 십 더하기 오 쌍반점

빈 초기화 괄호열고닫기 쌍반점
빈 주기 괄호열고닫기 쌍반점

정수 진입점 괄호열고닫기
중괄호열기
	초기화 괄호열고닫기 쌍반점

	동안 괄호열기 참 괄호닫기
	중괄호열기
		주기 괄호열고닫기 쌍반점
	중괄호닫기
	
	반환 영 쌍반점
중괄호닫기

빈 초기화 괄호열고닫기
중괄호열기
	시스템 괄호열기 "title 계산기" 괄호닫기 쌍반점
	시스템 괄호열기 "mode con cols=52 lines=25" 괄호닫기 쌍반점

	출력창_이동막대_정보 출력창이동막대정보 쌍반점

	출력창이동막대정보 멤버 ㅂ보임 대입 거짓 쌍반점
	출력창이동막대정보 멤버 ㅂㄱㅈ치수 대입 일 쌍반점

	출력창이동막대정보설정 괄호열기 표준관리자얻기 괄호열기 표준_출력_관리자 괄호닫기 와 주소 출력창이동막대정보 괄호닫기 쌍반점
중괄호닫기

빈 주기 괄호열고닫기
중괄호열기
	정밀실수 ㄱ 대입 영 쌍반점
	정밀실수 ㄴ 대입 영 쌍반점
	문자 연산자 대입 ' ' 쌍반점
	정밀실수 결과 대입 영 쌍반점

	서식출력 괄호열기 "두 수를 입력하세요 (예 : 5 + 3, 3.14 * 5, 6 / 4, 7 % 3)%s>> " 와 줄바꿈 괄호닫기 쌍반점
	입력 ㄱ 쌍반점
	입력 연산자 쌍반점
	입력 ㄴ 쌍반점

	선택 괄호열기 연산자 괄호닫기
	중괄호열기
	선택자 '+' 쌍점
		결과 대입 ㄱ 더하기 ㄴ 쌍반점
		
		중단 쌍반점
	선택자 '-' 쌍점
		결과 대입 ㄱ 빼기 ㄴ 쌍반점

		중단 쌍반점
	선택자 '*' 쌍점
		결과 대입 ㄱ 곱하기 ㄴ 쌍반점
		
		중단 쌍반점
	선택자 '/' 쌍점
		결과 대입 ㄱ 나누기 ㄴ 쌍반점
		
		중단 쌍반점
	기본 쌍점
		서식출력 괄호열기 "연산자 입력이 잘 못 되었습니다. (+, -, *, / 중 하나가 포함되어 있지 않음.)%s" 와 줄바꿈 괄호닫기 쌍반점
		
		반환 쌍반점
	중괄호닫기

	서식출력 괄호열기 "%.8f %c %.8f = %.8f%s" 와 ㄱ 과 연산자 와 ㄴ 과 결과 와 줄바꿈 괄호닫기 쌍반점
중괄호닫기