#include "한글"

상수 정수 출력창_가로 대입 사 곱하기 십 쌍반점
상수 정수 출력창_세로 대입 이 곱하기 십 쌍반점

빈 초기화 괄호열고닫기 쌍반점
빈 주기 괄호열고닫기 쌍반점
빈 ㅌㅍ가기 괄호열기 정수 ㅌ 과 정수 ㅍ 괄호닫기 쌍반점

정수 진입점 괄호열고닫기
중괄호열기
	초기화 괄호열고닫기 쌍반점
	
	동안 괄호열기 참 괄호닫기
	중괄호열기
		주기 괄호열고닫기 쌍반점
	중괄호닫기

	반환 영 쌍반점
중괄호닫기

빈 초기화 괄호열고닫기
중괄호열기
	무작위시드설정 괄호열기 괄호열기 부호없는정수 괄호닫기 시간 괄호열기 영 괄호닫기 괄호닫기 쌍반점
	
	시스템 괄호열기 "title 예제 337" 괄호닫기 쌍반점
	시스템 괄호열기 "mode con cols=40 lines=20" 괄호닫기 쌍반점

	출력창_이동막대_정보 출력창이동막대정보 쌍반점

	출력창이동막대정보 멤버 ㅂ보임 대입 거짓 쌍반점
	출력창이동막대정보 멤버 ㅂㄱㅈ치수 대입 일 쌍반점

	출력창이동막대정보설정 괄호열기 표준관리자얻기 괄호열기 표준_출력_관리자 괄호닫기 와 주소 출력창이동막대정보 괄호닫기 쌍반점
중괄호닫기

빈 주기 괄호열고닫기
중괄호열기
	정수 ㅌ 쌍반점
	정수 ㅍ 쌍반점

	반복 괄호열기 ㅍ 대입 영 쌍반점 ㅍ 보다큰 출력창_세로 쌍반점 ㅍ 증감 괄호닫기
	중괄호열기
		반복 괄호열기 ㅌ 대입 영 쌍반점 ㅌ 보다큰 출력창_가로 빼기 일 쌍반점 ㅌ 더하기대입 이 괄호닫기
		중괄호열기
			ㅌㅍ가기 괄호열기 ㅌ 과 ㅍ 괄호닫기 쌍반점
			
			만약 괄호열기 무작위 괄호열고닫기 비트그리고 일 괄호닫기
			중괄호열기
				출력 "●" 쌍반점
			중괄호닫기
			만약아니면
			중괄호열기
				출력 "○" 쌍반점
			중괄호닫기
		중괄호닫기
	중괄호닫기

	잠자기 괄호열기 이 곱하기 십 더하기 오 괄호닫기 쌍반점

	시스템 괄호열기 "cls" 괄호닫기 쌍반점
중괄호닫기

빈 ㅌㅍ가기 괄호열기 정수 ㅌ 과 정수 ㅍ 괄호닫기
중괄호열기
	좌표 위치 대입 중괄호열기 ㅌ 과 ㅍ 중괄호닫기 쌍반점
	
	출력창이동막대좌표설정 괄호열기 표준관리자얻기 괄호열기 표준_출력_관리자 괄호닫기 와 위치 괄호닫기 쌍반점
중괄호닫기