#ifndef __미로_게임_머리__
#define __미로_게임_머리__

#include "한글"

#define 출력창_가로 이 곱하기 십
#define 출력창_세로 십

빈 ㅌㅍ가기 괄호열기 정수 ㅌ 과 정수 ㅍ 괄호닫기 쌍반점

클래스 미로
중괄호열기
비공개 쌍점
	정수 현재놀이단계 대입 일 쌍반점
	정수 놀이하는자ㅌ좌표 쌍반점
	정수 놀이하는자ㅍ좌표 쌍반점
	정수 미로출구ㅌ좌표 쌍반점
	정수 미로출구ㅍ좌표 쌍반점
	불 놀이장소 대괄호열기 출력창_가로 곱하기 출력창_세로 대괄호닫기 대입
	중괄호열기
		거짓 과 참 과 거짓 과 거짓 과 거짓 과 참 과 참 과 거짓 과 거짓 과 참 과 거짓 과 거짓 과 참 과 참 과 거짓 과 거짓 과 거짓 과 거짓 과 참 과 거짓 과
		거짓 과 거짓 과 거짓 과 참 과 거짓 과 참 과 거짓 과 참 과 거짓 과 참 과 참 과 거짓 과 거짓 과 참 과 참 과 거짓 과 참 과 거짓 과 거짓 과 거짓 과
		참 과 참 과 참 과 참 과 거짓 과 거짓 과 거짓 과 거짓 과 거짓 과 참 과 거짓 과 거짓 과 참 과 거짓 과 거짓 과 거짓 과 참 과 참 과 거짓 과 참 과
		참 과 거짓 과 거짓 과 거짓 과 거짓 과 참 과 거짓 과 참 과 거짓 과 참 과 거짓 과 참 과 참 과 거짓 과 참 과 거짓 과 거짓 과 참 과 거짓 과 거짓 과
		거짓 과 거짓 과 참 과 거짓 과 거짓 과 참 과 거짓 과 거짓 과 거짓 과 참 과 거짓 과 거짓 과 참 과 거짓 과 참 과 참 과 거짓 과 참 과 참 과 참 과
		거짓 과 참 과 참 과 참 과 거짓 과 거짓 과 참 과 참 과 거짓 과 거짓 과 참 과 거짓 과 참 과 거짓 과 거짓 과 거짓 과 참 과 참 과 거짓 과 거짓 과
		거짓 과 참 과 거짓 과 참 과 참 과 거짓 과 거짓 과 참 과 거짓 과 참 과 거짓 과 거짓 과 참 과 거짓 과 참 과 참 과 참 과 거짓 과 거짓 과 참 과
		거짓 과 참 과 거짓 과 거짓 과 거짓 과 거짓 과 참 과 참 과 거짓 과 참 과 참 과 거짓 과 거짓 과 거짓 과 거짓 과 거짓 과 거짓 과 거짓 과 거짓 과 거짓 과
		거짓 과 참 과 참 과 참 과 참 과 거짓 과 거짓 과 참 과 거짓 과 거짓 과 거짓 과 참 과 거짓 과 참 과 거짓 과 거짓 과 참 과 거짓 과 참 과 거짓 과
		거짓 과 거짓 과 거짓 과 거짓 과 참 과 참 과 거짓 과 참 과 참 과 참 과 거짓 과 거짓 과 거짓 과 참 과 참 과 참 과 참 과 거짓 과 참 과 거짓
	중괄호닫기 쌍반점

공개 쌍점
	미로 괄호열기 정수 처음놀이하는자좌표ㅌ 과 정수 처음놀이하는자좌표ㅍ 과 정수 미로출구ㅌ좌표 와 정수 미로출구ㅍ좌표 괄호닫기 쌍반점

	빈 놀이화면출력 괄호열고닫기 쌍반점
	빈 놀이하는자움직이기 괄호열고닫기 쌍반점
	빈 미로에서나갔는지검사 괄호열고닫기 쌍반점
	빈 놀이하는자좌표에출력 괄호열기 문자 출력할문자 괄호닫기 쌍반점
중괄호닫기 쌍반점

#endif