#include "미로게임.h"

빈 ㅌㅍ가기 괄호열기 정수 ㅌ 과 정수 ㅍ 괄호닫기
중괄호열기
	좌표 위치 대입 중괄호열기 ㅌ 과 ㅍ 중괄호닫기 쌍반점

	출력창이동막대좌표설정 괄호열기 표준관리자얻기 괄호열기 표준_출력_관리자 괄호닫기 와 위치 괄호닫기 쌍반점
중괄호닫기

미로 두쌍점 미로 괄호열기 정수 처음놀이하는자좌표ㅌ 과 정수 처음놀이하는자좌표ㅍ 과 정수 미로출구ㅌ좌표 와 정수 미로출구ㅍ좌표 괄호닫기 쌍점 놀이하는자ㅌ좌표 괄호열기 처음놀이하는자좌표ㅌ 괄호닫기 와 놀이하는자ㅍ좌표 괄호열기 처음놀이하는자좌표ㅍ 괄호닫기 와 미로출구ㅌ좌표 괄호열기 미로출구ㅌ좌표 괄호닫기 와 미로출구ㅍ좌표 괄호열기 미로출구ㅍ좌표 괄호닫기
중괄호열기
	시스템 괄호열기 "title 미로 게임" 괄호닫기 쌍반점
	시스템 괄호열기 "mode con cols=20 lines=10" 괄호닫기 쌍반점

	출력창_이동막대_정보 출력창이동막대정보 쌍반점

	출력창이동막대정보 멤버 ㅂ보임 대입 영 쌍반점
	출력창이동막대정보 멤버 ㅂㄱㅈ치수 대입 일 쌍반점

	출력창이동막대정보설정 괄호열기 표준관리자얻기 괄호열기 표준_출력_관리자 괄호닫기 와 주소 출력창이동막대정보 괄호닫기 쌍반점

	놀이하는자좌표에출력 괄호열기 '@' 괄호닫기 쌍반점
	ㅌㅍ가기 괄호열기 미로출구ㅌ좌표 와 미로출구ㅍ좌표 괄호닫기 쌍반점

	출력 "!" 쌍반점
중괄호닫기

빈 미로 두쌍점 놀이화면출력 괄호열고닫기
중괄호열기
	반복 괄호열기 정수 ㅍ 대입 영 쌍반점 ㅍ 보다큰 출력창_세로 쌍반점 ㅍ 증감 괄호닫기
	중괄호열기
		반복 괄호열기 정수 ㅌ 대입 영 쌍반점 ㅌ 보다큰 출력창_가로 쌍반점 ㅌ 증감 괄호닫기
		중괄호열기
			ㅌㅍ가기 괄호열기 ㅌ 과 ㅍ 괄호닫기 쌍반점
			
			만약 괄호열기 놀이장소 대괄호열기 ㅌ 더하기 ㅍ 곱하기 출력창_가로 대괄호닫기 괄호닫기
			중괄호열기
				출력 "#" 쌍반점
			중괄호닫기
		중괄호닫기
	중괄호닫기
중괄호닫기

빈 미로 두쌍점 놀이하는자움직이기 괄호열고닫기
중괄호열기
	정수 누른자판 대입 누름자판눌림 물음표 눌린자판얻기 쌍점 마이너스 이 쌍반점

	선택 괄호열기 누른자판 괄호닫기
	중괄호열기
	선택자 팔 곱하기 십 더하기 칠 쌍점
	선택자 백 더하기 십 더하기 구 쌍점
		만약 괄호열기 놀이하는자ㅍ좌표 빼기 일 보다작거나같음 영 그리고 반대 놀이장소 대괄호열기 놀이하는자ㅌ좌표 더하기 괄호열기 놀이하는자ㅍ좌표 빼기 일 괄호닫기 곱하기 출력창_가로 대괄호닫기 괄호닫기
		중괄호열기
			놀이하는자좌표에출력 괄호열기 ' ' 괄호닫기 쌍반점
			
			놀이하는자ㅍ좌표 감소 쌍반점
			
			놀이하는자좌표에출력 괄호열기 '@' 괄호닫기 쌍반점
			미로에서나갔는지검사 괄호열고닫기 쌍반점
		중괄호닫기
		
		중단 쌍반점
	선택자 육 곱하기 십 더하기 오 쌍점
	선택자 구 곱하기 십 더하기 칠 쌍점
		만약 괄호열기 놀이하는자ㅌ좌표 빼기 일 보다작거나같음 영 그리고 반대 놀이장소 대괄호열기 놀이하는자ㅌ좌표 빼기 일 더하기 놀이하는자ㅍ좌표 곱하기 출력창_가로 대괄호닫기 괄호닫기
		중괄호열기
			놀이하는자좌표에출력 괄호열기 ' ' 괄호닫기 쌍반점
			
			놀이하는자ㅌ좌표 감소 쌍반점
			
			놀이하는자좌표에출력 괄호열기 '@' 괄호닫기 쌍반점
			미로에서나갔는지검사 괄호열고닫기 쌍반점
		중괄호닫기
		
		중단 쌍반점
	선택자 팔 곱하기 십 더하기 삼 쌍점
	선택자 백 더하기 십 더하기 오 쌍점
		만약 괄호열기 놀이하는자ㅍ좌표 더하기 일 보다큰 출력창_세로 그리고 반대 놀이장소 대괄호열기 놀이하는자ㅌ좌표 더하기 괄호열기 놀이하는자ㅍ좌표 더하기 일 괄호닫기 곱하기 출력창_가로 대괄호닫기 괄호닫기
		중괄호열기
			놀이하는자좌표에출력 괄호열기 ' ' 괄호닫기 쌍반점
			
			놀이하는자ㅍ좌표 증감 쌍반점
			
			놀이하는자좌표에출력 괄호열기 '@' 괄호닫기 쌍반점
			미로에서나갔는지검사 괄호열고닫기 쌍반점
		중괄호닫기
		
		중단 쌍반점
	선택자 육 곱하기 십 더하기 팔 쌍점
	선택자 백 쌍점
		만약 괄호열기 놀이하는자ㅌ좌표 더하기 일 보다큰 출력창_가로 그리고 반대 놀이장소 대괄호열기 놀이하는자ㅌ좌표 더하기 일 더하기 놀이하는자ㅍ좌표 곱하기 출력창_가로 대괄호닫기 괄호닫기
		중괄호열기
			놀이하는자좌표에출력 괄호열기 ' ' 괄호닫기 쌍반점
			
			놀이하는자ㅌ좌표 증감 쌍반점
			
			놀이하는자좌표에출력 괄호열기 '@' 괄호닫기 쌍반점
			미로에서나갔는지검사 괄호열고닫기 쌍반점
		중괄호닫기
		
		중단 쌍반점
	중괄호닫기
중괄호닫기

빈 미로 두쌍점 미로에서나갔는지검사 괄호열고닫기
중괄호열기
	만약 괄호열기 놀이하는자ㅌ좌표 같음 미로출구ㅌ좌표 그리고 놀이하는자ㅍ좌표 같음 미로출구ㅍ좌표 괄호닫기
	중괄호열기
		ㅌㅍ가기 괄호열기 괄호열기 출력창_가로 비트오른쪽시프트 일 괄호닫기 빼기 사 와 출력창_세로 비트오른쪽시프트 일 괄호닫기 쌍반점
		
		출력 "놀이 끝!" 쌍반점
		
		현재놀이단계 증감 쌍반점

		잠자기 괄호열기 천 괄호닫기 쌍반점
		시스템 괄호열기 "cls" 괄호닫기 쌍반점
		종료 괄호열기 영 괄호닫기 쌍반점
	중괄호닫기
중괄호닫기

빈 미로 두쌍점 놀이하는자좌표에출력 괄호열기 문자 출력할문자 괄호닫기
중괄호열기
	ㅌㅍ가기 괄호열기 놀이하는자ㅌ좌표 와 놀이하는자ㅍ좌표 괄호닫기 쌍반점

	출력 출력할문자 쌍반점
중괄호닫기